# Agenda: Week 3 â€” real-world data

0. Q&A -- setting up an environment on your computer
1. More about CSV
2. Reading data from online sources
3. Sorting
4. Grouping
5. Pivot tables
6. Joining
7. Cleaning data

# Setting up an environment

At the end of the day, in order to run the sorts of programs we're talking about in class, you'll need:

- Python - easiest way is from https://python.org/
- NumPy / Pandas / Matplotlib -- easiest way is with `pip`
- Somewhere to write that code and then run it

My preference is:

- Install Python from python.org
- Install packages via `pip`
- Edit in PyCharm (for long things) and Jupyter (for short things)
    - Install PyCharm from the JetBrains site
    - Install Jupyter with `pip`

There can be issues/differences with installing Python:
- You might install it with Anaconda, an all-in-one system
- I often install (on my Mac) the version of Python from "Homebrew," an open-source installation system

Jupyter can cause all sorts of other issues.

Basically, if you can be running Jupyter, then you can experiment with what I'm doing in class most directly, including using the files that I'm uploading to GitHub.

If you want to download + use my Jupyter notebook files, then you need to download them from GitHub (you can clone or just download a zipfile).

There's one Jupyter file (with a `.ipynb` suffix) for each day of the course.  Put that into the directory where you're running Jupyter, and you'll be able to open it on your computer.

I'm also going to be creating HTML versions of every Jupyter notebook, after class happens.  That'll allow you to view it in a browser without running Jupyter.

In [1]:
# recap a bit from last week -- loading a CSV file

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# create a data frame from a CSV file

df = pd.read_csv('taxi.csv')
df.head()                       # did we load the file correctly?

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

# Assumptions of `read_csv`:

1. The fields on each line are separated by commas (`,`)
2. The first line in the file contains header/column names 
3. Pandas will guess the `dtype` that it should give to each column:
    - If the column only contains integers, it's made a `np.int64`
    - If the column contains digits + decimal points, it's made a `np.float64`
    - Everything else is considered a string, which is stored as a Python string as dtype `object`

In [4]:
# retrieve a column with []

df['trip_distance']

0       1.63
1       0.46
2       0.87
3       2.13
4       1.40
        ...
9994    2.70
9995    4.50
9996    5.59
9997    1.54
9998    5.80
Name: trip_distance, Length: 9999, dtype: float64

In [5]:
# retrieve multiple columns with a list in []

df[['trip_distance', 'total_amount']]

      trip_distance  total_amount
0              1.63         17.80
1              0.46          8.30
2              0.87         11.00
3              2.13         17.16
4              1.40         10.30
...             ...           ...
9994           2.70         12.30
9995           4.50         20.30
9996           5.59         22.30
9997           1.54          7.80
9998           5.80         26.75

[9999 rows x 2 columns]

In [6]:
# retrieve one row with its index, using .loc

df.loc[3]

VendorID                                   2
tpep_pickup_datetime     2015-06-02 11:19:31
tpep_dropoff_datetime    2015-06-02 11:39:02
passenger_count                            1
trip_distance                           2.13
pickup_longitude                  -73.945892
pickup_latitude                    40.773529
RateCodeID                                 1
store_and_fwd_flag                         N
dropoff_longitude                 -73.971527
dropoff_latitude                    40.76033
payment_type                               1
fare_amount                             13.5
extra                                    0.0
mta_tax                                  0.5
tip_amount                              2.86
tolls_amount                             0.0
improvement_surcharge                    0.3
total_amount                           17.16
Name: 3, dtype: object

In [10]:
# retrieve multiple rows with df.loc and a "row selector"
# - one index
# - list of indexes
# - boolean series, used as a mask index

df.loc[df['passenger_count'] > 5]

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
30,2,2015-06-02 11:19:55,2015-06-02 11:32:57,6,0.81,-73.999336,40.754444,1,N,-73.996078,40.748554,2,8.5,0.0,0.5,0.00,0.0,0.3,9.30
62,2,2015-06-02 11:20:17,2015-06-02 11:24:33,6,0.51,-73.953720,40.775059,1,N,-73.960892,40.774948,2,5.0,0.0,0.5,0.00,0.0,0.3,5.80
71,2,2015-06-02 11:20:25,2015-06-02 11:35:44,6,0.88,-73.994125,40.751011,1,N,-73.985313,40.758541,1,10.0,0.0,0.5,3.24,0.0,0.3,14.04
146,2,2015-06-02 11:21:23,2015-06-02 11:33:09,6,1.21,-73.998741,40.744953,1,N,-73.980057,40.736820,1,9.0,0.0,0.5,2.45,0.0,0.3,12.25
188,2,2015-06-02 11:21:52,2015-06-02 11:36:17,6,1.84,-73.971909,40.794464,1,N,-73.963913,40.776718,1,11.0,0.0,0.5,2.36,0.0,0.3,14.16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9953,2,2015-06-01 00:13:42,2015-06-01 00:21:01,6,1.07,-73.994072,40.759239,1,N,-73.976021,40.751888,1,7.0,0.5,0.5,2.49,0.0,0.3,10.79
9961,2,2015-06-01 00:13:05,2015-06-01 00:22:38,6,2.72,-73.923241,40.767677,1,N,-73.956253,40.747513,1,10.5,0.5,0.5,2.36,0.0,0.3,14.16
9963,2,2015-06-01 00:13:07,2015-06-01 00:21:14,6,1.52,-73.972778,40.750256,1,N,-73.989075,40.762695,2,8.0,0.5,0.5,0.00,0.0,0.3,9.30
9989,2,2015-06-01 00:13:41,2015-06-01 00:17:44,6,1.34,-74.005898,40.735851,1,N,-73.991318,40.748177,1,6.0,0.5,0.5,1.46,0.0,0.3,8.76
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80

In [11]:
# giving df.loc two arguments, we can provide a row selector and a column selector:
# - a column name
# - a list of column names
# - a boolean series for the columns (weird and rare)

df.loc[
    df['passenger_count'] > 5   # row selector
    ,
    ['trip_distance', 'total_amount']   # column selector
]

      trip_distance  total_amount
30             0.81          9.30
62             0.51          5.80
71             0.88         14.04
146            1.21         12.25
188            1.84         14.16
...             ...           ...
9953           1.07         10.79
9961           2.72         14.16
9963           1.52          9.30
9989           1.34          8.76
9997           1.54          7.80

[369 rows x 2 columns]

# What if we don't want all of the columns?

Each column that we read into memory consumes RAM. If we have a big file, we might want to choose only selected columns when we read the CSV file into memory.

We can do that by passing the `usecols` parameter to `read_csv`, and providing a list of columns.

In [12]:
df = pd.read_csv('taxi.csv',
                usecols=['trip_distance', 'total_amount', 'tip_amount', 'passenger_count'])

In [13]:
df.head()

   passenger_count  trip_distance  tip_amount  total_amount
0                1           1.63        0.00         17.80
1                1           0.46        1.00          8.30
2                1           0.87        2.20         11.00
3                1           2.13        2.86         17.16
4                1           1.40        0.00         10.30

In [15]:
df = pd.read_csv('taxi.csv',
                usecols=[3, 4, 15, 18])
df.head()

   passenger_count  trip_distance  tip_amount  total_amount
0                1           1.63        0.00         17.80
1                1           0.46        1.00          8.30
2                1           0.87        2.20         11.00
3                1           2.13        2.86         17.16
4                1           1.40        0.00         10.30

# Headers (or not)

If the CSV file doesn't have a header row, then the first row will be automatically seen as the column 
names -- which can be bad if it's actually data!  

You can tell Pandas to treat the first row in the file as data (not headers) by passing `header=None`.

If the header row isn't on the first line of the file, then you can pass `header=n`, where `n` is the number of the row where the column names are actually located.  Pandas will skip over the first `n` rows of the file, read the headers, and then read the data.

In [16]:
pd.read_csv('taxi.csv', header=None)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
0,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
1,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
3,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
4,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792053222656,40.814971923828125,1,N,-73.973358154296875,40.783638000488281,2,11,0.5,0.5,0,0,0.3,12.3
9996,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066467285156,40.747817993164063,1,N,-73.953758239746094,40.779285430908203,1,16,0.5,0.5,3,0,0.3,20.3
9997,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377136230469,40.766101837158203,1,N,-73.903205871582031,40.750545501708984,2,21,0.5,0.5,0,0,0.3,22.3
9998,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302001953125,40.748531341552734,1,N,-73.989166259765625,40.762851715087891,2,6.5,0.5,0.5,0,0,0.3,7.8
9999,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.98321533203125,40.726413726806641,1,N,-73.92413330078125,40.701644897460938,1,21,0.5,0.5,4.45,0,0.3,26.75

Every data frame has two attributes that you can/should know about:

- `index`, which contains the index (for the rows)
- `columns`, which contains the column names (as an index object, but applied on the other axis)

You can actually assign to either of these, if you want to modify the index or columns; just provide an index object or (if you prefer) a series or list.

In [17]:
df.index

RangeIndex(start=0, stop=9999, step=1)

In [18]:
df.columns

Index(['passenger_count', 'trip_distance', 'tip_amount', 'total_amount'], dtype='object')

In [19]:
# time and date data -- currently, as read, they're treated as strings
# next week, we'll be talking about how to parse and work with it

# delimiter in CSV is ',' by default, but you can pass something else with sep='\t' (for tab)
# if you have , in your data fields, then CSV knows how to handle that (by putting "" around it)

In [21]:
df = DataFrame([[10, 20, 30],
                [40, 50, 60],
                [70, 80, 90]],
              index=list('xyz'),
              columns=list('abc'))
df

    a   b   c
x  10  20  30
y  40  50  60
z  70  80  90

In [22]:
df['b'] = ['hello, out there', 'goodbye', 'whatever']
df

    a                 b   c
x  10  hello, out there  30
y  40           goodbye  60
z  70          whatever  90

In [23]:
print(df.to_csv())

,a,b,c
x,10,"hello, out there",30
y,40,goodbye,60
z,70,whatever,90

In [24]:
# use tab (\t) as the separator when writing
print(df.to_csv(sep='\t'))

	a	b	c
x	10	hello, out there	30
y	40	goodbye	60
z	70	whatever	90

In [26]:
# write to a file

df.to_csv('mydata.csv', sep='\t')

In [27]:
# let's read from the file
# first, without specifying the separator

df = pd.read_csv('mydata.csv')
df

                          \ta\tb\tc
x\t10\thello          out there\t30
y\t40\tgoodbye\t60              NaN
z\t70\twhatever\t90             NaN

In [28]:
# now let's specify the separator
df = pd.read_csv('mydata.csv', sep='\t')
df

  Unnamed: 0   a                 b   c
0          x  10  hello, out there  30
1          y  40           goodbye  60
2          z  70          whatever  90

In [29]:
!cat mydata.csv

	a	b	c
x	10	hello, out there	30
y	40	goodbye	60
z	70	whatever	90

# Index when reading data

By default, `read_csv` will return a data frame with a numeric index starting at 0 and going to the length-1.  What if one of the columns in your file should be the index?  Or if you just want to set the index to be one of those columns?

Answer: Pass `index_col` and the name of the index column.

In [30]:
df = pd.read_csv('mydata.csv', sep='\t', index_col='Unnamed: 0')
df

    a                 b   c
x  10  hello, out there  30
y  40           goodbye  60
z  70          whatever  90

In [34]:
df = pd.read_csv('mydata.csv', sep='\t', index_col=0)    # here, we pass the integer 0, not the string '0'
df

    a                 b   c
x  10  hello, out there  30
y  40           goodbye  60
z  70          whatever  90

In [35]:
# read_csv has a *LOT* of different options!

help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]', *, sep: 'str | None | lib.NoDefault' = <no_default>, delimiter: 'str | None | lib.NoDefault' = None, header: "int | Sequence[int] | None | Literal['infer']" = 'infer', names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>, index_col: 'IndexLabel | Literal[False] | None' = None, usecols=None, squeeze: 'bool | None' = None, prefix: 'str | lib.NoDefault' = <no_default>, mangle_dupe_cols: 'bool' = True, dtype: 'DtypeArg | None' = None, engine: 'CSVEngine | None' = None, converters=None, true_values=None, false_values=None, skipinitialspace: 'bool' = False, skiprows=None, skipfooter: 'int' = 0, nrows: 'int | None' = None, na_values=None, keep_default_na: 'bool' = True, na_filter: 'bool' = True, verbose: 'bool' = False, skip_blank_lines: 'bool' = True, parse_dates=None, infer_datetime_format: 'bool' = False, keep_date_col: 'bool' = False, date_parser=None, dayfirst: 'bool' = False, cache_dates: 'bool' = True, iterator: 'bool' = False, chunksize: 'int | None' = None, compression: 'CompressionOptions' = 'infer', thousands: 'str | None' = None, decimal: 'str' = '.', lineterminator: 'str | None' = None, quotechar: 'str' = '"', quoting: 'int' = 0, doublequote: 'bool' = True, escapechar: 'str | None' = None, comment: 'str | None' = None, encoding: 'str | None' = None, encoding_errors: 'str | None' = 'strict', dialect: 'str | csv.Dialect | None' = None, error_bad_lines: 'bool | None' = None, warn_bad_lines: 'bool | None' = None, on_bad_lines=None, delim_whitespace: 'bool' = False, low_memory=True, memory_map: 'bool' = False, float_precision: "Literal['high', 'legacy'] | None" = None, storage_options: 'StorageOptions' = None) -> 'DataFrame | TextFileReader'
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, None, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, optional, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.

        .. deprecated:: 1.4.0
            Append ``.squeeze("columns")`` to the call to ``read_csv`` to squeeze
            the data.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...

        .. deprecated:: 1.4.0
           Use a list comprehension on the DataFrame's columns after calling ``read_csv``.
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.

        .. deprecated:: 1.5.0
            Not implemented, and a new argument to specify the pattern for the
            names of duplicated columns will be added instead
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.

        .. versionadded:: 1.5.0

            Support for defaultdict was added. Specify a defaultdict as input where
            the default determines the dtype of the columns which are not explicitly
            listed.
    engine : {'c', 'python', 'pyarrow'}, optional
        Parser engine to use. The C and pyarrow engines are faster, while the python engine
        is currently more feature-complete. Multithreading is currently only supported by
        the pyarrow engine.

        .. versionadded:: 1.4.0

            The "pyarrow" engine was added as an *experimental* engine, and some features
            are unsupported, or may not work correctly, with this engine.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
        (otherwise no compression).
        If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
        Set to ``None`` for no decompression.
        Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'tar'``} and other
        key-value pairs are forwarded to
        ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, ``zstandard.ZstdDecompressor`` or
        ``tarfile.TarFile``, respectively.
        As an example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

            .. versionadded:: 1.5.0
                Added support for `.tar` files.

        .. versionchanged:: 1.4.0 Zstandard support.

    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

        .. versionchanged:: 1.2

           When ``encoding`` is ``None``, ``errors="replace"`` is passed to
           ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
           This behavior was previously only the case for ``engine="python"``.

        .. versionchanged:: 1.3.0

           ``encoding_errors`` is a new argument. ``encoding`` has no longer an
           influence on how encoding errors are handled.

    encoding_errors : str, optional, default "strict"
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, optional, default ``None``
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will be dropped from the DataFrame that is
        returned.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    warn_bad_lines : bool, optional, default ``None``
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

            - 'error', raise an Exception when a bad line is encountered.
            - 'warn', raise a warning when a bad line is encountered and skip that line.
            - 'skip', skip bad lines without raising or warning when they are encountered.

        .. versionadded:: 1.3.0

        .. versionadded:: 1.4.0

            - callable, function with signature
              ``(bad_line: list[str]) -> list[str] | None`` that will process a single
              bad line. ``bad_line`` is a list of strings split by the ``sep``.
              If the function returns ``None``, the bad line will be ignored.
              If the function returns a new list of strings with more elements than

# Exercise: Airlines

I've put a file, `airlines.dat`, into the GitHub directory.  Create a data frame from that file.

This file is a database of all airlines in the world.

- You'll have to look at it to see what headers it has (if any)
- You'll have to check to see what delimiter it uses to separate fields
- In the end, the data frame should contain several columns:
    - Airline's name
    - Airline's 2-character code
    - Airline's 3-character code
    - Airline's country

In [36]:
!head -20 airlines.dat

1,"Private flight",\N,"-","N/A","","","Y"
2,"135 Airways",\N,"","GNL","GENERAL","United States","N"
3,"1Time Airline",\N,"1T","RNX","NEXTIME","South Africa","Y"
4,"2 Sqn No 1 Elementary Flying Training School",\N,"","WYT","","United Kingdom","N"
5,"213 Flight Unit",\N,"","TFU","","Russia","N"
6,"223 Flight Unit State Airline",\N,"","CHD","CHKALOVSK-AVIA","Russia","N"
7,"224th Flight Unit",\N,"","TTF","CARGO UNIT","Russia","N"
8,"247 Jet Ltd",\N,"","TWF","CLOUD RUNNER","United Kingdom","N"
9,"3D Aviation",\N,"","SEC","SECUREX","United States","N"
10,"40-Mile Air",\N,"Q5","MLA","MILE-AIR","United States","Y"
11,"4D Air",\N,"","QRT","QUARTET","Thailand","N"
12,"611897 Alberta Limited",\N,"","THD","DONUT","Canada","N"
13,"Ansett Australia",\N,"AN","AAA","ANSETT","Australia","Y"
14,"Abacus International",\N,"1B","","","Singapore","Y"
15,"Abelag Aviation",\N,"W9","AAB","ABG","Belgium","N"
16,"Army Air Corps",\N,"","AAC","ARMYAIR","United Kingdom","N"
17,"Aero Aviation Centre Ltd.",\N,"","AAD","SUNRISE","Canada","N"
18,"Aero Servicios Ejecutivos Internacionales",\N,"","SII","ASEISA","Mexico","N"
19,"Aero Biniza",\N,"","BZS","BINIZA","Mexico","N"
20,"Aero Albatros",\N,"","ABM","ALBATROS ESPANA","Spain","N"

In [41]:
filename = 'airlines.dat'
df = pd.read_csv(filename, 
                 header=None,     # first line is data, not column names!
                 usecols=[1, 3, 4, 5, 6]
    )

# assign the column names once we're done
df.columns = ['name', '2code', '3code', 'longname', 'country']

df.head(20)

,name,2code,3code,longname,country
0,Private flight,-,NaN,NaN,NaN
1,135 Airways,NaN,GNL,GENERAL,United States
2,1Time Airline,1T,RNX,NEXTIME,South Africa
3,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom
4,213 Flight Unit,NaN,TFU,NaN,Russia
5,223 Flight Unit State Airline,NaN,CHD,CHKALOVSK-AVIA,Russia
6,224th Flight Unit,NaN,TTF,CARGO UNIT,Russia
7,247 Jet Ltd,NaN,TWF,CLOUD RUNNER,United Kingdom
8,3D Aviation,NaN,SEC,SECUREX,United States
9,40-Mile Air,Q5,MLA,MILE-AIR,United States
10,4D Air,NaN,QRT,QUARTET,Thailand
11,611897 Alberta Limited,NaN,THD,DONUT,Canada
12,Ansett Australia,AN,AAA,ANSETT,Australia
13,Abacus International,1B,NaN,NaN,Singapore
14,Abelag Aviation,W9,AAB,ABG,Belgium
15,Army Air Corps,NaN,AAC,ARMYAIR,United Kingdom
16,Aero Aviation Centre Ltd.,NaN,AAD,SUNRISE,Canada
17,Aero Servicios Ejecutivos Internacionales,NaN,SII,ASEISA,Mexico
18,Aero Biniza,NaN,BZS,BINIZA,Mexico
19,Aero Albatros,NaN,ABM,ALBATROS ESPANA,Spain

In [42]:
# alternative: set the column names in read_csv with the "names" parameter

filename = 'airlines.dat'
df = pd.read_csv(filename, 
                 header=None,     # first line is data, not column names!
                 usecols=[1, 3, 4, 5, 6],
                 names=['name', '2code', '3code', 'longname', 'country']
    )

df.head(20)

,name,2code,3code,longname,country
0,Private flight,-,NaN,NaN,NaN
1,135 Airways,NaN,GNL,GENERAL,United States
2,1Time Airline,1T,RNX,NEXTIME,South Africa
3,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom
4,213 Flight Unit,NaN,TFU,NaN,Russia
5,223 Flight Unit State Airline,NaN,CHD,CHKALOVSK-AVIA,Russia
6,224th Flight Unit,NaN,TTF,CARGO UNIT,Russia
7,247 Jet Ltd,NaN,TWF,CLOUD RUNNER,United Kingdom
8,3D Aviation,NaN,SEC,SECUREX,United States
9,40-Mile Air,Q5,MLA,MILE-AIR,United States
10,4D Air,NaN,QRT,QUARTET,Thailand
11,611897 Alberta Limited,NaN,THD,DONUT,Canada
12,Ansett Australia,AN,AAA,ANSETT,Australia
13,Abacus International,1B,NaN,NaN,Singapore
14,Abelag Aviation,W9,AAB,ABG,Belgium
15,Army Air Corps,NaN,AAC,ARMYAIR,United Kingdom
16,Aero Aviation Centre Ltd.,NaN,AAD,SUNRISE,Canada
17,Aero Servicios Ejecutivos Internacionales,NaN,SII,ASEISA,Mexico
18,Aero Biniza,NaN,BZS,BINIZA,Mexico
19,Aero Albatros,NaN,ABM,ALBATROS ESPANA,Spain

In [43]:
# I have a CSV file on GitHub at

# https://gist.github.com/reuven/361d2c2b12dab426f4ed4efb396c89e5

# or in raw format:

# https://gist.githubusercontent.com/reuven/361d2c2b12dab426f4ed4efb396c89e5/raw/744dc0e9b193b53e3f76712cdfa32fa443440594/AAPL.csv

# how can I read that into Pandas?
# option 1: Download the file, and then read it into Pandas from my local filesystem

# option 2: Give read_csv a URL
# (use the raw data from gists on GitHub, or it won't work)

df = pd.read_csv('https://gist.githubusercontent.com/reuven/361d2c2b12dab426f4ed4efb396c89e5/raw/744dc0e9b193b53e3f76712cdfa32fa443440594/AAPL.csv')
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
1,2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2,2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
3,2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
4,2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300

In [44]:
# report on International Happiness Day is at
# https://happiness-report.s3.amazonaws.com/2023/DataForTable2.1WHR2023.xls

# I can read Excel files into Pandas with read_excel

df = pd.read_excel('https://happiness-report.s3.amazonaws.com/2023/DataForTable2.1WHR2023.xls')

In [45]:
df.head()

,Country name,year,Life Ladder,Log GDP per capita,Social support,Healthy life expectancy at birth,Freedom to make life choices,Generosity,Perceptions of corruption,Positive affect,Negative affect
0,Afghanistan,2008,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195
1,Afghanistan,2009,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092
2,Afghanistan,2010,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324
3,Afghanistan,2011,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175
4,Afghanistan,2012,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919

In [46]:
# if there is a Web page containing an HTML table that is of interest to me
# I can ask Pandas to read the page, and turn the table(s) into data frames

url = 'https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)'

all_dfs = pd.read_html(url)

In [47]:
# all_dfs is now a list of data frames
# each HTML table at that URL is a separate data frame

all_dfs[0]

                                                   0
0  Largest economies in the world by GDP (nominal...

In [48]:
all_dfs[1]

,0,1,2
0,.mw-parser-output .legend{page-break-inside:av...,$750 billion â€“ $1 trillion $500â€“750 billion $2...,$50â€“100 billion $25â€“50 billion $5â€“25 billion <...

In [49]:
all_dfs[2]

    Country/Territory UN Region IMF[1][13]            World Bank[14]  \
    Country/Territory UN Region   Estimate       Year       Estimate
0               World         â€”  101560901       2022       96513077
1       United States  Americas   25035164       2022       22996100
2               China      Asia   18321197  [n 1]2022       17734063
3               Japan      Asia    4300621       2022        4937422
4             Germany    Europe    4031149       2022        4223116
..                ...       ...        ...        ...            ...
212             Palau   Oceania        226       2022            218
213          Kiribati   Oceania        207       2022            207
214             Nauru   Oceania        134       2022            133
215        Montserrat  Americas          â€”          â€”              â€”
216            Tuvalu   Oceania         64       2022             63

               United Nations[15]
          Year           Estimate       Year
0         2021           85328323       2020
1         2021           20893746       2020
2    [n 3]2021           14722801  [n 1]2020
3         2021            5057759       2020
4         2021            3846414       2020
..         ...                ...        ...
212       2021                264       2020
213       2021                181       2020
214       2021                135       2020
215          â€”                 68       2020
216       2021                 55       2020

[217 rows x 8 columns]

In [50]:
# get our data frame from the list we retrieved
df = all_dfs[2]

# set better column names
df.columns = ['country', 'region', 'imf_estimate', 'imf_year', 'wb_estimate', 'wb_year', 'un_estimate', 'un_year']

In [51]:
df.head(20)

,country,region,imf_estimate,imf_year,wb_estimate,wb_year,un_estimate,un_year
0,World,â€”,101560901,2022,96513077,2021,85328323,2020
1,United States,Americas,25035164,2022,22996100,2021,20893746,2020
2,China,Asia,18321197,[n 1]2022,17734063,[n 3]2021,14722801,[n 1]2020
3,Japan,Asia,4300621,2022,4937422,2021,5057759,2020
4,Germany,Europe,4031149,2022,4223116,2021,3846414,2020
5,India,Asia,3468566,2022,3173398,2021,2664749,2020
6,United Kingdom,Europe,3198470,2022,3186860,2021,2764198,2020
7,France,Europe,2778090,2022,2937473,2021,2630318,2020
8,Canada,Americas,2200352,2022,1988336,2021,1644037,2020
9,Russia,Europe,2133092,2022,1775800,2021,1483498,2020
10,Italy,Europe,1996934,2022,2107703,2021,1888709,2020
11,Iran,Asia,1973738,[n 4]2022,359713,2021,939316,2020
12,Brazil,Americas,1894708,2022,1608981,2021,1444733,2020
13,South Korea,Asia,1734207,2022,1798534,2021,1637896,2020
14,Australia,Oceania,1724787,2022,1542660,2021,1423473,2020
15,Mexico,Americas,1424533,2022,1293038,2021,1073439,2020
16,Spain,Europe,1389927,2022,1425277,2021,1281485,2020
17,Indonesia,Asia,1289429,2022,1186093,2021,1058424,2020
18,Saudi Arabia,Asia,1010588,2022,833541,2021,700118,2020
19,Netherlands,Europe,990583,2022,1018007,2021,913865,2020

In [52]:
# we can remove the row at index 0 with drop
# that returns a new data frame, which we can assign back to df

df = df.drop(0)

In [53]:
df.head()

,country,region,imf_estimate,imf_year,wb_estimate,wb_year,un_estimate,un_year
1,United States,Americas,25035164,2022,22996100,2021,20893746,2020
2,China,Asia,18321197,[n 1]2022,17734063,[n 3]2021,14722801,[n 1]2020
3,Japan,Asia,4300621,2022,4937422,2021,5057759,2020
4,Germany,Europe,4031149,2022,4223116,2021,3846414,2020
5,India,Asia,3468566,2022,3173398,2021,2664749,2020

# Exercise: Population

1. Find the wikipedia page for country populations. (If you want to download something else, that's fine, too ... but you're on your own!)
2. Use `pd.read_html` to retrieve all tables from that page as data frames.
3. Find the population of your country in that data frame.  (Note: You'll need to look at the column names, and use the right name for your country.)

In [54]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population'

all_dfs = pd.read_html(url)

In [59]:
df = all_dfs[1]
df.columns = ['rank', 'country', 'population', 'percent_of_world', 'date', 'source', 'notes']

In [60]:
df.head()

,rank,country,population,percent_of_world,date,source,notes
0,â€“,World,8020285000,100%,21 Mar 2023,UN projection[3],NaN
1,1,China,1411750000,NaN,31 Dec 2022,Official estimate[4],The population figure refers to mainland China...
2,2,India,1388163000,NaN,1 Mar 2023,Official projection[5],The figure includes the population of the Indi...
3,3,United States,334524000,NaN,21 Mar 2023,National population clock[6],The figure includes the 50 states and the Dist...
4,4,Indonesia,275773800,NaN,1 Jul 2022,Official estimate[7],NaN

In [61]:
# what dtypes do we have in this data frame?
df.dtypes

rank                object
country             object
population           int64
percent_of_world    object
date                object
source              object
notes               object
dtype: object

In [63]:
df.loc[df['country'] == 'Israel']

,rank,country,population,percent_of_world,date,source,notes
92,91,Israel,9694400,NaN,21 Mar 2023,National population clock[90],The figure includes East Jerusalem and the Gol...

In [65]:
df.loc[df['country'] == 'Morocco']

,rank,country,population,percent_of_world,date,source,notes
39,39,Morocco,36901040,NaN,21 Mar 2023,National population clock[42],Excluding the disputed territory of Western Sa...

# Next up

1. Sorting
2. Grouping

In [70]:
highs = [21, 22, 24, 17, 17, 19, 23, 21, 18, 15]
lows = [10, 15, 15, 14, 14, 13, 11, 11, 10, 8]

# create my data frame from a dict!
df = DataFrame({'high': highs,
                'low': lows,
               'date':'19 20 21 22 23 24 25 26 27 28'.split()})

df = df.set_index('date')  # use a column as the index

df

      high  low
date
19      21   10
20      22   15
21      24   15
22      17   14
23      17   14
24      19   13
25      23   11
26      21   11
27      18   10
28      15    8

In [71]:
# I want to know on which dates I'm going to see the highest temperatures

df.sort_values('high')   # this returns a new data frame, based on df, with the rows sorted by high

      high  low
date
28      15    8
22      17   14
23      17   14
27      18   10
24      19   13
19      21   10
26      21   11
20      22   15
25      23   11
21      24   15

In [72]:
# sort by value, but in descending order

df.sort_values('high', ascending=False)   # by default, it's ascending=True

      high  low
date
21      24   15
25      23   11
20      22   15
19      21   10
26      21   11
24      19   13
27      18   10
22      17   14
23      17   14
28      15    8

In [73]:
# let's say that I have sorted my values in this way, and I assigned them back to df

df = df.sort_values('high', ascending=False)
df

      high  low
date
21      24   15
25      23   11
20      22   15
19      21   10
26      21   11
24      19   13
27      18   10
22      17   14
23      17   14
28      15    8

In [74]:
# wait -- I want to sort the data frame by its *index*, not by any other column
# how can I do that?

# answer: sort_index

df.sort_index()

      high  low
date
19      21   10
20      22   15
21      24   15
22      17   14
23      17   14
24      19   13
25      23   11
26      21   11
27      18   10
28      15    8

In [75]:
# a good general rule in Pandas is: Wherever you can pass a single column as a string,
# you pass multiple columns as a list of strings

# Meaning: I can sort first by high temp, then (if there is a tie) by low temp

df.sort_values(['high', 'low'])

      high  low
date
28      15    8
22      17   14
23      17   14
27      18   10
24      19   13
19      21   10
26      21   11
20      22   15
25      23   11
21      24   15

In [76]:
# reset_index returns a new data frame in which our index is made back into a regular column

df.reset_index()

  date  high  low
0   21    24   15
1   25    23   11
2   20    22   15
3   19    21   10
4   26    21   11
5   24    19   13
6   27    18   10
7   22    17   14
8   23    17   14
9   28    15    8

# Why sort?

- I want the top / bottom n values in a data frame
- some things (e.g., slice on the index) requires that the index be sorted

In [77]:
# let's add a column, for the temp diff
df['diff'] = df['high'] - df['low']

In [78]:
df

      high  low  diff
date
21      24   15     9
25      23   11    12
20      22   15     7
19      21   10    11
26      21   11    10
24      19   13     6
27      18   10     8
22      17   14     3
23      17   14     3
28      15    8     7

In [79]:
df.sort_values('diff')

      high  low  diff
date
22      17   14     3
23      17   14     3
24      19   13     6
20      22   15     7
28      15    8     7
27      18   10     8
21      24   15     9
26      21   11    10
19      21   10    11
25      23   11    12

In [80]:
!ls *.csv

mydata.csv  taxi.csv

# Exercise: Best tippers

1. Read `taxi.csv` into a data frame.  We're only interested in `trip_distance`, `total_amount`, and `tip_amount`.
2. Calculate the percentage tip that people gave in each ride, and assign to a new column, `tip_percentage`.  (If you run into trouble with `total_amount` being 0, add 0.0001 to `total_amount` before dividing.)
3. Find the `trip_distance` for the 10 trips with the greatest tip percentage.

In [82]:
df = pd.read_csv('taxi.csv', usecols=['trip_distance', 'total_amount', 'tip_amount'])
df.head()

   trip_distance  tip_amount  total_amount
0           1.63        0.00         17.80
1           0.46        1.00          8.30
2           0.87        2.20         11.00
3           2.13        2.86         17.16
4           1.40        0.00         10.30

In [84]:
# create a new column, tip_percentage,
# and assign the value of amount / total
df['tip_percentage'] = df['tip_amount'] / df['total_amount']

In [85]:
df.head()

   trip_distance  tip_amount  total_amount  tip_percentage
0           1.63        0.00         17.80        0.000000
1           0.46        1.00          8.30        0.120482
2           0.87        2.20         11.00        0.200000
3           2.13        2.86         17.16        0.166667
4           1.40        0.00         10.30        0.000000

In [90]:
# sort by tip percentage
# I want the distance from the 10 highest tip percentages

df.sort_values('tip_percentage', ascending=False).head(10)['trip_distance']

4430    5.40
7945    0.00
6940    0.00
1621    1.10
3624    0.60
457     4.76
5031    1.30
2792    0.00
3954    0.00
4695    0.81
Name: trip_distance, dtype: float64

# Grouping

If I have, in my data frame, a categorical column and a numeric column, and I want to know the result of running an aggregate method on the numeric column for each value of the categorical column... that's grouping.

In [91]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population'

all_dfs = pd.read_html(url)

df = all_dfs[1]
df.columns = ['rank', 'country', 'population', 'percent_of_world', 'date', 'source', 'notes']

In [92]:
df.head()

,rank,country,population,percent_of_world,date,source,notes
0,â€“,World,8020285000,100%,21 Mar 2023,UN projection[3],NaN
1,1,China,1411750000,NaN,31 Dec 2022,Official estimate[4],The population figure refers to mainland China...
2,2,India,1388163000,NaN,1 Mar 2023,Official projection[5],The figure includes the population of the Indi...
3,3,United States,334524000,NaN,21 Mar 2023,National population clock[6],The figure includes the 50 states and the Dist...
4,4,Indonesia,275773800,NaN,1 Jul 2022,Official estimate[7],NaN

In [95]:
# if there is a Web page containing an HTML table that is of interest to me
# I can ask Pandas to read the page, and turn the table(s) into data frames

url = 'https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)'

all_dfs = pd.read_html(url)

# get our data frame from the list we retrieved
df = all_dfs[2]

# set better column names
df.columns = ['country', 'region', 'imf_estimate', 'imf_year', 'wb_estimate', 'wb_year', 'un_estimate', 'un_year']

# remove the first "World" row
df = df.drop(0)

In [96]:
df.head()

,country,region,imf_estimate,imf_year,wb_estimate,wb_year,un_estimate,un_year
1,United States,Americas,25035164,2022,22996100,2021,20893746,2020
2,China,Asia,18321197,[n 1]2022,17734063,[n 3]2021,14722801,[n 1]2020
3,Japan,Asia,4300621,2022,4937422,2021,5057759,2020
4,Germany,Europe,4031149,2022,4223116,2021,3846414,2020
5,India,Asia,3468566,2022,3173398,2021,2664749,2020

In [98]:
# I want to know the IMF's average estimate for GDP for the entire world

df.dtypes

country         object
region          object
imf_estimate    object
imf_year        object
wb_estimate     object
wb_year         object
un_estimate     object
un_year         object
dtype: object

In [110]:
# keep only the top 180, which are integers

df = df.loc[:180]
df['imf_estimate'] = df['imf_estimate'].astype(np.int64)

In [111]:
df.head()

,country,region,imf_estimate,imf_year,wb_estimate,wb_year,un_estimate,un_year
1,United States,Americas,25035164,2022,22996100,2021,20893746,2020
2,China,Asia,18321197,[n 1]2022,17734063,[n 3]2021,14722801,[n 1]2020
3,Japan,Asia,4300621,2022,4937422,2021,5057759,2020
4,Germany,Europe,4031149,2022,4223116,2021,3846414,2020
5,India,Asia,3468566,2022,3173398,2021,2664749,2020

In [112]:
# what is the mean IMF estimate for GDP for all countries?

df['imf_estimate'].mean()

1629208.8833333333

In [116]:
# what is the mean IMF estimate for GDP for all countries in the Americas?

df.loc[df['region'] == 'Americas',    # row selector
       'imf_estimate'].mean()         # column selector

4009821.625

In [117]:
df.loc[df['region'] == 'Europe',    # row selector
       'imf_estimate'].mean()         # column selector

1038836.1818181818

In [118]:
df.loc[df['region'] == 'Asia',    # row selector
       'imf_estimate'].mean()         # column selector

1701620.4782608696

In [119]:
df.loc[df['region'] == 'Africa',    # row selector
       'imf_estimate'].mean()         # column selector

342961.2

In [120]:
df['region'].value_counts()

Asia        23
Europe      22
Americas     8
Africa       5
Oceania      2
Name: region, dtype: int64

In [121]:
df.loc[df['region'] == 'Oceana',    # row selector
       'imf_estimate'].mean()         # column selector

nan

In [122]:
# I went through each value in df['region'], found the rows in that region,
# and then ran mean() on the IMF estimate for that

# this is grouping -- running the same aggregate calculation on all rows for each
# category, and then list all of the answers

#         categorical    numeric      aggregation method
df.groupby('region')['imf_estimate'].mean()

region
Africa      3.429612e+05
Americas    4.009822e+06
Asia        1.701620e+06
Europe      1.038836e+06
Oceania     9.837435e+05
Name: imf_estimate, dtype: float64

In [123]:
pd.set_option('display.precision', 2)  # show 2 numbers after the decimal point

In [125]:
df.groupby('region')['imf_estimate'].mean()

region
Africa      3.43e+05
Americas    4.01e+06
Asia        1.70e+06
Europe      1.04e+06
Oceania     9.84e+05
Name: imf_estimate, dtype: float64

In [130]:
# tell Pandas to show all floats with commas every 3 characters, 
# only 2 digits after the .

pd.set_option('display.float_format',  '{:,.2f}'.format)

In [131]:
df.groupby('region')['imf_estimate'].mean()

region
Africa       342,961.20
Americas   4,009,821.62
Asia       1,701,620.48
Europe     1,038,836.18
Oceania      983,743.50
Name: imf_estimate, dtype: float64

# Some examples of where we might use grouping

- Mean sales per region
- Max revenue per department
- Mean taxes p